### Train Test Split

- The reason why the dataset is splitted is to find how good the model performs for the data that it has not seen yet.

In [21]:
import pandas as pd
df = pd.read_csv('carsprice.csv')
df

    Mileage  Age(yrs)  Sell Price($)
0     69000         6          18000
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
5     59000         5          26750
6     52000         5          32000
7     72000         6          19300
8     91000         8          12000
9     67000         6          22000
10    83000         7          18700
11    79000         7          19500
12    59000         5          26000
13    58780         4          27500
14    82450         7          19400
15    25400         3          35000
16    28000         2          35500
17    69000         5          19700
18    87600         8          12800
19    52000         5          28200

In [22]:
X = df[['Mileage', 'Age(yrs)']]
y = df[['Sell Price($)']]

In [23]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [24]:
X_train

    Mileage  Age(yrs)
9     67000         6
18    87600         8
7     72000         6
3     22500         2
16    28000         2
15    25400         3
11    79000         7
6     52000         5
4     46000         4
14    82450         7
8     91000         8
0     69000         6
5     59000         5
1     35000         3
17    69000         5
10    83000         7

In [25]:
X_test

    Mileage  Age(yrs)
19    52000         5
12    59000         5
2     57000         5
13    58780         4

In [31]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression()

In [34]:
model.score(X_test, y_test)

-0.9472122199615705